<?
//  ###################################################################################    
//                                                                                         
//    cancel.php                                                                           
//                                                                                        
//    Copyright (c) 1997-2002 PG사 Co. LTD.                           
//    All rights reserved.                                                                 
//                                                                                         
//  ###################################################################################    
//  ###################################################################################    
//                                                                      
//   PG사에서 승인취소 결과를 받아 DB에 수정하는 모듈                         
//                                                                      
//  ###################################################################################    
//                                                                      
//  [ return.php를 호출할때 인자로 넘어오는 구성요소 ]                           
//                                                                      
//   1. ReplyCode    : 응답코드로 '0000'이면 정상 그외는 에러처리한다.                  
//   2. ScrMessage   : 응답메시지                                             
//   3. OrderDate    : 거래요청일자(YYYYMMDD)                                        
//   4. SequenceNo   : 거래요청번호                                                 
//   5. OrderNo      : 주문번호                                             
//   6. CancelDate   : 거래취소일자(YYYYMMDD)                                        
//   7. CancelTime   : 거래취소시간(HHMMSS)                                           
//   8. UserID       : UserID
//   9. Reserved1    : FILLER                                             
//  10. Reserved1    : FILLER                                             
//                                                                      
//    * Mall에서는 해당 페이지를 수정하여 결과를 DB에 수정할 수 있도록 한다.            
//                                                                      
//                                                                      
//                                                                      
//  ###################################################################################    
include "./config.php";
include "./log.php";
include "./mysql_function.php";
include "./php_function.php";


//*************************************************************************
//  MAIN
//*************************************************************************

	


	echo "0000";

?>
