<?

//	숫자로만 되어 있는지 검사한다.
//	return: true or false
//
function FncOnlyDigits ($svValue)
{
	$svCheckValue = ereg_replace( "[^0-9]", "",$svValue);
  	if ($svCheckValue == $svValue)
	{	return "1";
  	}
  	else
  	{	return "0";
  	}
};

//******************************************************************************
//	문자열($str)의 오른쪽에 지정된 문자($c)를 길이($len)만큼 채운다.
//
//
//******************************************************************************
function PadR( $str,$len,$c=" " )
{
	$ret = substr( $str,0,$len );
	for ( $i=0; strlen($ret) < $len; $i++ )
	{
		$ret .= $c;
	}
	return $ret;
}

//******************************************************************************
//	문자열($str)의 왼쪽에 지정된 문자($c)를 길이($len)만큼 채운다.
//
//
//******************************************************************************
function PadL( $str,$len,$c=" " )
{
	$ret = substr( $str,-$len );
	for ( $i=0; strlen($ret) < $len; $i++ )
	{
		$ret = $c . $ret;
	}
	return $ret;
}

//******************************************************************************
//	현제 System 날짜을 조회한다.
//	Format -> YYYYMMDD
//
//******************************************************************************
Function f_Now_Date()
{
	return Date( "Ymd" );
}

//******************************************************************************
//	현제 System 시간을 조회한다.
//	Format -> HH24MISS
//
//******************************************************************************
Function f_Now_Time()
{
	return Date( "His" );
}

?>